Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: དེ་དག་གནས་པ་ཅི་འདྲ་ཞིག །
en: What is their abode?

source: དེ་དག་སྦྱོར་བའང་ཇི་ལྟ་བུ། །
en: What is their occupation?”

source: དེ་དག་སྤྱོད་ཡུལ་སྟོང་པ་ཉིད། །
en: “Their domain is emptiness,

source: གནས་ནི་ཕ་རོལ་ཕྱིན་པའི་ལམ། །
en: Their basis is the path of the perfections,

source: གནས་པ་བསམ་གཏན་བཞི་རྣམས་ཏེ། །
en: Their abode is the four concentrations, And

source: སེམས་ཅན་རབ་གྲོལ་སྦྱོར་བའོ། །
en: their occupation is the liberation of beings.”

source: དེ་དག་བདུད་ཀྱི་ལས་གང་ཡིན། །
en: “What is demonic activity for them?

source: སངས་རྒྱས་ཕྲིན་ལས་ཇི་ལྟ་བུ། །
en: What is awakened activity for them?

source: ཅི་འདྲ་བ་ཡི་ལས་བྱས་ན། །བྱང་ཆུབ་ལ་ནི་གཞོལ་བར་འགྱུར། །
en: What kind of activity is involved In their pursuit of awakening?”

source: ཐེག་པ་ཆུང་ངུ་བདུད་ཀྱི་ལས། །སངས་རྒྱས་ཕྲིན་ལས་ཐེག་པ་ཆེ། །སྡིག་པ་ཐམས་ཅད་སྤོང་བ་ནི། །བྱང་ཆུབ་གཞོལ་བར་འགྱུར་བའོ། །
en: “Demonic activity is the Lower Vehicle, Awakened activity is the Great Vehicle, And the abandonment of all unwholesome deeds Is how they pursue awakening.”

source: དེ་དག་གྲོགས་བསྟེན་ཇི་ལྟ་བུ། །
en: “Who are the friends they attend to?

source: སྡིག་པའི་གྲོགས་པོ་ཅི་འདྲ་ཞིག །
en: Who are unwholesome friends for them?

source: ལོག་པར་ལྟ་ལ་མི་གནས་ཤིང་། །ཇི་ལྟར་ཡང་དག་སོང་བར་འགྱུར། །
en: How do they follow the proper path Without adhering to wrong views?”

source: གང་ཞིག་བྱང་ཆུབ་ལམ་སྟོན་པ། །རྟག་ཏུ་བདེ་སྦྱིན་གྲོགས་པོའོ། །
en: “Those who show the path to awakening Are friends who always confer happiness.

source: བྱང་ཆུབ་སེམས་ལས་གང་ཟློག་པ། །དེ་དག་སྡིག་པའི་གྲོགས་པོར་ཤེས། །
en: Those who turn one away from the mind of awakening Are understood to be unwholesome friends.”

source: སིལ་སྙན་རྣམས་ཀྱིས་སྨྲས་པ། །
en: The instruments asked:

source: ལམ་དུ་འཇུག་པར་འགྱུར་བ་ཡི། །ལྟ་བ་དྲང་པོ་ཇི་ལྟ་བུ། །
en: “What is the right view When embarking on the path?

source: སྦྱོར་བ་རྣམ་པར་ཤེས་ནས་སུ། །ཇི་ལྟར་ལྟ་དེ་འཇིག་མི་བྱེད། །
en: How does their understanding of engagement Prevent that view from being undermined?”

source: ལས་དང་བྱ་བར་འཇུག་པ་ནི། །དེ་དག་དྲང་པོར་ལྟ་བ་ཡིན། །
en: “Engaging in deeds and activities Is the right view, And

source: ལོག་པར་སྦྱོར་བ་རྣམ་ཤེས་ནས། །ལྟ་བ་དེ་དག་འཇིག་མི་བྱེད། །
en: understanding the wrong types of engagement Prevents that view from being undermined.”

source: ཇི་ལྟར་དམ་པའི་ཆོས་བསྲུང་ཞིང་། །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད། །
en: “How do they guard the sacred Dharma And ripen beings?

source: ཇི་ལྟ་བུ་ཡི་ཐབས་ཀྱིས་ནི། །དེ་དག་བྱང་ཆུབ་བསྒྲུབ་པར་འགྱུར། །
en: Through which method Do they accomplish awakening?”

source: བརྩོན་འགྲུས་ཀྱིས་ནི་ཆོས་བསྲུང་སྟེ། །
en: “They guard the Dharma with diligence,

source: བསྡུ་བས་ཡོངས་སུ་སྨིན་པར་བྱེད། །
en: They ripen beings through the means of attraction, And

source: མཐའ་གཉིས་རྣམ་པར་སྤངས་པས་ནི། །བྱང་ཆུབ་སྒྲུབ་པར་བྱེད་པ་ཡིན། །
en: they accomplish awakening By abandoning the two extremes.”

source: དེ་དག་ཤེས་པའི་ལམ་ཅི་འདྲ། །
en: “What is their path of knowledge like?

source: ང་རྒྱལ་ལས་ནི་ཇི་ལྟ་བུ། །
en: What comes from pride?

source: ཇི་ལྟར་བཀའ་བློ་བདེ་བ་དང་། །ཐམས་ཅད་དུས་སུ་འཐུན་པར་འགྱུར། །
en: How do they speak gently? And how are they always well disposed?”

source: རྩོད་པ་མེད་པ་ཤེས་པའི་ལས། །ང་རྒྱལ་ལས་ནི་རྩོད་པ་འབྱུང་། །
en: “Action based on knowledge is without conflict. Conflict comes from pride.

source: ངེས་པར་བཀའ་བློ་བདེ་བ་སྟེ། །གུས་པ་ཡིས་ནི་འཐུན་པར་འགྱུར། །
en: Through their gentle speech and respectful attitude, They are well disposed.”

source: དེ་དག་ལམ་ནི་ཇི་ལྟ་བུ། །
en: “What is their path like?

source: ལོག་པའི་ལམ་ཡང་ཅི་འདྲ་ཞིག །
en: What is the wrong path like?

source: བླ་མེད་བྱང་ཆུབ་ལམ་དུ་ནི། །ཇི་ལྟར་སེམས་ཅན་རབ་ཏུ་འགོད། །
en: How do they establish beings On the path to unsurpassed awakening?”

source: ལམ་ནི་ཕ་རོལ་ཕྱིན་པ་དྲུག །ཐེག་པ་ཆུང་ངུ་ལོག་པའི་ལམ། །ཤེས་རབ་ཐབས་ལ་བསླབས་པ་ནི། །སེམས་ཅན་ལམ་ལ་འཛུད་པའོ། །
en: “Their path is the six perfections, The Lower Vehicle is the wrong path for them, And they lead sentient beings on the path Through the trainings in insight and method.”

source: ཇི་ལྟ་བུར་ན་ནོར་ཆེན་འགྱུར། །
en: “In what way are they wealthy?

source: དེ་དག་རྙེད་པའང་ཅི་འདྲ་ཞིག །
en: What have they gained?

source: གཏེར་རྣམས་ཀྱང་ནི་ཇི་ལྟ་བུ། །
en: What is their treasure?

source: གང་གིས་དེ་དག་འགྲོ་ཚིམ་བྱེད། །
en: How do they bring satisfaction to beings?”

source: ནོར་བདུན་དང་ནི་རྟག་ཏུ་ལྡན། །
en: “They always possess the seven riches,

source: ཆོས་རྙེད་པ་ནི་རྙེད་པའོ། །
en: They have gained the acquisition of the Dharma, And

source: དེ་དག་གཏེར་ནི་གཟུངས་ཡིན་ཏེ།
en: their treasure is recall.

source: རབ་ཏུ་རྙེད་ནས་ཚིམ་པར་བྱེད། །
en: With such gains they satisfy others.”

source: དེ་དག་གི་ནི་ཕ་མ་གང་། །
en: “Who are their parents?

source: ཉེ་དུའི་ཚོགས་ནི་ཇི་ལྟ་བུ། །
en: Who are their kinsmen?

source: གཡོག་རྣམས་ཀྱང་ནི་ཅི་འདྲ་ཞིག །
en: Who are their servants?

source: གང་གིས་མཁས་པ་དེ་དག་མཛེས། །
en: What adorns those wise ones?”

source: མ་ནི་ཤེས་རབ་ཕ་ནི་ཐབས། །ཉེ་དུ་བྱང་ཆུབ་ཕྱོགས་རྣམས་ཡིན། །
en: “Their mother is insight, their father is method, Their kinsmen are the factors of awakening, And

source: དགེ་བ་རྣམས་ནི་གཡོག་ཡིན་ཏེ། །
en: their servants are virtuous actions;

source: དེས་ནི་མཁས་པ་དེ་དག་མཛེས། །
en: These are what adorn those wise ones.”

source: ཇི་ལྟར་བདག་མེད་རྟོགས་ནས་ནི། །བྱམས་པས་འགྲོ་བ་ཁྱབ་པར་བྱེད། །
en: “After having realized selflessness, How does their love extend to all beings?

source: བདག་མེད་པ་དང་བྱམས་པ་དག །དེ་ལ་ཇི་ལྟར་མཚུངས་པར་འགྱུར། །
en: In what way are selflessness and love Equal for them?”

source: གང་དག་སྟོང་ཉིད་རབ་ཤེས་པ། །དེ་ནི་བདག་མེད་ཁོང་དུ་ཆུད། །
en: “Those who understand emptiness Realize selflessness.

source: གང་གིས་འགྲོ་བ་སྟོང་ཤེས་པ། །དེ་ནི་དེ་ཡི་བྱམས་པ་མཆོག །
en: Understanding the emptiness of beings— That is their supreme love.”

source: འདུ་བྱེད་རྣམས་ནི་རང་བཞིན་གྱིས། །འོང་བ་མེད་ཅིང་འགྲོ་མེད་ན། །
en: “If formations are intrinsically Beyond coming and going,

source: ལས་དང་ལས་ཀྱི་རྣམ་པར་སྨིན། །ཇི་ལྟ་བུར་ན་འཐད་པར་འགྱུར། །
en: How can it make sense to speak of Actions and their ripening?”

source: དམ་པའི་དོན་དུ་འོང་མེད་དེ། །གང་དུའང་འགྲོ་བ་ཡོད་མ་ཡིན། །
en: “Ultimately, everything is Beyond coming and going.

source: ཀུན་རྫོབ་ཏུ་ན་ལམ་འཇུག་ཅིང་། །རྣམ་པར་སྨིན་པ་ཉེ་བར་སྟོན། །
en: But on the relative level it is taught That one should enter the path and that karmic ripening exists.”

source: སྟོང་ཉིད་མཚན་མ་མེད་པ་དང་། །སྨོན་ལམ་རྣམ་པར་སྤངས་པར་ནི། །མཚན་ཉིད་གཅིག་ཏུ་རབ་རྟོགས་ནས། །དེ་ཁོ་ན་ནི་ཇི་ལྟར་ཤེས། །
en: “How do they understand suchness By realizing that emptiness, the absence of marks, And the abandonment of wishes Have a single characteristic?”

source: སྟོང་ཉིད་གང་ཡིན་དེ་མཚན་མེད། །མཚན་མ་དོན་དུ་གཉེར་མེད་པ། །མཚན་ཉིད་གཅིག་ཅིང་དོན་གཅིག་སྟེ། །རྣམ་པར་ཐར་པའི་སྒོ་བསྟན་ཏོ། །
en: “Emptiness is the absence of marks— It is free from pursuing any marks. It has a single characteristic and a single meaning That reveals the gateway to liberation.”

source: གང་གིས་མྱ་ངན་འདས་འགྲོ་བའི། །སྟོང་པར་རྟོག་པ་ཇི་ལྟ་བུ། །སེམས་ཅན་ལྟ་བ་ཇི་ལྟ་བུ། །ཡོངས་སུ་སྨིན་བྱེད་ཇི་ལྟ་བུ། །
en: “How do they realize emptiness That leads to nirvāṇa? How do they consider beings? And how do they ripen them?”

source: ཤེས་རབ་ཀྱིས་ནི་སྟོང་པར་རྟོགས། །
en: “They realize emptiness through insight,

source: ཐབས་ཀྱིས་སེམས་ཅན་རྣམས་ལ་ལྟ། །
en: They consider beings through methods, And

source: སྙིང་རྗེས་ཡོངས་སུ་སྨིན་པར་བྱེད། །
en: they ripen them through compassion;

source: དེས་ནི་མྱ་ངན་འདས་པར་འགྲོ། །
en: That is what leads to nirvāṇa.”

source: ཆོས་འདི་དག་ནི་ཆོས་ཉིད་ཀྱིས། །སྐྱེ་བ་མེད་ཅིང་འབྱུང་མེད་པར། །ཚུལ་མཆོག་འདི་འདྲ་ཤེས་ནས་ནི། །གང་གིས་འཁོར་བར་སྐྱེ་བར་འགྱུར། །
en: “Phenomena are intrinsically Beyond birth and origination; What causes them to be reborn in saṃsāra After having understood this supreme way?”

source: མི་སྐྱེ་བ་དང་མི་འབྱུང་བ། །དེ་ནི་ཤེས་རབ་སྤྱོད་ཡུལ་ལོ། །
en: “The absence of birth and origination Is the domain of insight.

source: བསམས་བཞིན་དུ་ནི་གང་སྐྱེ་བ། །དེ་ནི་ཐབས་ཀྱི་ཚུལ་ཡིན་ནོ། །
en: Taking rebirth intentionally Is the way of method.”

source: གཏོང་ལ་དགའ་བར་ཇི་ལྟར་འགྱུར། །
en: “How do they take pleasure in giving?

source: ཇི་ལྟ་བུར་ནི་ཕྱིར་མི་ལྡོག །
en: In what way have they reached the state of irreversibility?

source: ཇི་ལྟར་བཟོད་པ་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་རྣམ་པར་ངེས་པར་འགྱུར། །
en: In what way have they developed perfect acceptance? How have they reached certainty?”

source: མཉམ་པར་གནས་པར་གཏོང་ལ་དགའ། །
en: “They take pleasure in giving while resting in equanimity,

source: ཆོས་ཀྱི་དབྱིངས་ལས་ཕྱིར་མི་ལྡོག །
en: They do not turn away from the realm of phenomena,

source: མི་སྐྱེ་བ་ལ་བཟོད་པ་སྟེ། །ཆོས་ཤེས་ནས་ནི་རྣམ་པར་ངེས། །
en: They have reached acceptance of the unborn, And they have reached certainty by understanding the Dharma.”

source: བྱང་ཆུབ་སྙིང་པོ་སྙིང་པོ་གང་། །
en: “What is the seat of awakening?

source: རྫོགས་པའི་བྱང་ཆུབ་མཚན་ཉིད་གང་། །
en: What is the characteristic of perfect awakening?

source: ཅི་ཕྱིར་རྫོགས་སངས་རྒྱས་ཤེས་བྱ། །
en: What is meant by the perfect buddhas?

source: དེ་བཞིན་གཤེགས་པ་ཇི་ལྟར་གྲོལ། །
en: In what way are the thus-gone ones liberated?”

source: བྱང་ཆུབ་སྙིང་པོ་ནམ་མཁའ་སྟེ། །
en: “The quintessence of awakening is space—

source: བྱང་ཆུབ་ནམ་མཁའི་མཚན་ཉིད་དོ། །
en: Awakening has the characteristic of space.

source: གང་ཡང་ཀུན་ནས་གཏི་མུག་མེད། །དེ་བཞིན་ཉིད་ཕྱིར་དེ་བཞིན་གཤེགས། །
en: The buddhas are known as thus-gone ones, Since they are completely free of ignorance and have arrived at suchness.”

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོའི་བུ་དེ་དག་གིས་ཚིགས་སུ་བཅད་པ་འདི་དག་ཐོས་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་བོ། །
en: When they heard those verses, the sons of the kiṃnara king attained acceptance of the unborn nature of phenomena.

source: དེ་དག་གིས་བཟོད་པ་རབ་ཏུ་ཐོབ་ནས་
en: Then, having attained that acceptance,

source: རང་རང་གི་གོས་དང་རྒྱན་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བཀབ་སྟེ། འདི་སྐད་ཅེས་ཀྱང་གསོལ་ཏོ། །
en: they covered the Blessed One in their respective garments and ornaments and said,

source: !བཅོམ་ལྡན་འདས་གང་གི་སླད་དུ་བདག་ཅག་གིས་ཉན་པའི་རྣ་བ་འདི་ལྟ་བུ་ཐོབ་པས་སངས་རྒྱས་ནི་བདག་ཅག་གི་ཆེད་དུ་བྱུང་ངོ་། །
en: “Blessed One, why has the Buddha manifested to us in the form of those verses we just heard?

source: བཅོམ་ལྡན་འདས་སིལ་སྙན་དང་གླུ་དབྱངས་འདི་དག་ལས་ཐེ་ཙོམ་འདྲི་བའི་སྒྲ་འདི་ལྟ་བུ་བྱུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་འདི་དག་གིས་དྲིས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ལན་བཏབ་པས་འཁོར་འདིའི་དོགས་པ་ཐམས་ཅད་སྤངས་པ་དང་། བདག་ཅག་ཀྱང་ཆོས་ཀྱི་སྣང་བ་དཔག་ཏུ་མ་མཆིས་པ་སྐྱེས་པ་ངོ་མཚར་ཏོ། །
en: Blessed One, the music and song gave voice to these questions that expressed doubt and, as the bodhisattva manifestations answered each of them, they dispelled all the doubts of the assembly, causing a boundless illumination of the Dharma to arise in us. This is amazing!

source: བཅོམ་ལྡན་འདས་སིལ་སྙན་དེ་དག་ལས་སྒྲ་འདི་ལྟ་བུ་བྱུང་བའི་རྒྱུ་ཅི་ལགས།
en: Blessed One, what has caused these tunes to be emanated from those instruments?

source: སུའི་བྱིན་གྱི་རླབས་ཀྱིས་ན་བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་འདི་དག་གིས་ལན་འདེབས་པར་གྱུར།
en: And whose blessings produced the answers of those bodhisattva manifestations?”

source: བཞིན་བཟངས་དག་དེ་དག་ཐམས་ཅད་ནི་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་བརླབས་སུ་བལྟའོ། །
en: “Good people,” “you should regard all of these as the blessings of the Buddha.

source: བཞིན་བཟངས་དག་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་བརླབས་ཀྱིས། ནམ་མཁའ་ལས་ཀྱང་ཆོས་ཀྱི་སྒྲ་འདི་ལྟ་བུ་བྱུང་ན་སིལ་སྙན་ལས་ཆོས་ཀྱི་སྒྲ་ཅི་ཕྱིར་མི་འབྱུང་སྟེ
en: Good people, if the sound of the Dharma can emanate even from the sky through the blessings of the Thus-Gone One, why would the sound of the Dharma not be emanated from instruments?

source: བཞིན་བཟངས་དག་དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ནི་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: Good people, in this way the blessings of the Thus-Gone One are inconceivable.”

source: མི་འམ་ཅིའི་རྒྱལ་པོའི་བུ་དེ་དག་གིས་གསོལ་པ།
en: The sons of the kiṃnara king then exclaimed,

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོབ་པར་གྱུར་ཅིག། །།
en: “Blessed One, may all sentient beings receive the inconceivable blessings of the Buddha!”

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་སླས་མི་འམ་ཅི་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་མུ་ཏིག་ཁ་དོག་སྣ་ཚོགས་ཀྱི་དོ་ཤལ་ཐོགས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: Then, eighty-four thousand kiṃnarī queens of the kiṃnara king Druma came to the place where the Blessed One was residing, carrying with them necklaces made of multicolored pearls.

source: ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཇི་ལྟར་ཐོགས་པའི་མུ་ཏིག་གི་དོ་ཤལ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བཀབ་བོ། །
en: When they arrived, they prostrated to the feet of the Blessed One and adorned him with the pearl necklaces they were carrying.

source: མུ་ཏིག་གི་དོ་ཤལ་དེ་དག་ཕུལ་མ་ཐག་ཏུ་སངས་རྒྱས་ཀྱི་མཐུས་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་དབུ་གཙུག་གི་དྲང་ཐད་ཀྱི་སྟེང་གི་བར་སྣང་ལ་མུ་ཏིག་གི་དོ་ཤལ་གྱི་ཁང་པ་བརྩེགས་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་གྱུར་ཏེ
en: As soon as they had made their offerings, those necklaces transformed, through the power of the Buddha, into eighty-four thousand pavilions made of pearl, in the sky above the Blessed One’s head.

source: ཁང་པ་བརྩེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གྲུ་བཞི་ལྷམ་པ། ཀ་བ་བཞི་ཟུག་པ། ཆ་མཉམ་པ། ངོས་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་ཤ་སྟག་གོ། །
en: All the mansions were square, supported by four pillars, well proportioned, and symmetrical.

source: ཁང་པ་བརྩེགས་པ་དེ་དག་ནི་རིན་པོ་ཆེས་སྤྲས་པའི་ཁྲི་རྩ་བ་ཡང་རིན་པོ་ཆེ་ལས་བྱས་པ། ལྷའི་རས་བཅོས་མའི་ཟུང་དུ་མ་བཀྲམ་པ་དག་བྱུང་བར་གྱུར་ཏོ། །
en: Inside those pavilions, thrones studded with jewels set on bases made of precious substances appeared, and many layers of divine fabrics were spread upon them.

source: ཁྲི་དེ་དག་ཐམས་ཅད་ལ་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་པ་དག་བཞུགས་པར་ཀུན་ཏུ་སྣང་ངོ་། །
en: Thus-gone ones adorned with the thirty-two major marks of great beings sat upon these thrones.

source: དེ་ནས་མི་འམ་ཅི་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཆོ་འཕྲུལ་འདི་ལྟ་བུ་འདི་མཐོང་ནསཚིམ་ཞིང་མགུ་སྟེ་ཡིད་རབ་ཏུ་དགའ་ནས་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ཏེ་བསམ་པ་ཐག་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: When they saw the magical display of the Blessed One, the eighty-four thousand kiṃnarīs became pleased, cheerful, thrilled, and elated. With joy and happiness filling their minds, they gave rise, from the bottom of their hearts, to the mind set on unsurpassed and perfect awakening.

source: དེ་དག་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་དགའ་ཞིང་མཆོག་ཏུ་དགའ་སྟེ་དད་པ་ཐོབ་ནས།
en: Then, filled with joy, delight, and faith,

source: ཐམས་ཅད་ཀྱིས་སྒྲ་སྐད་དང་དབྱངས་གཅིག་ཏུ་ཚུལ་དང་འཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་དོ། །
en: they offered, with one voice, these pleasing verses of praise to the Blessed One:

source: བླ་ན་མེད་པའི་དགྲ་བཅོམ་མཆོག་གསུང་བ། །དོན་དགོངས་མཚུངས་པ་མ་མཆིས་བསམ་མི་ཁྱབ། །དོན་དང་ཆོས་དང་འདུལ་བ་རབ་བསླབས་པ། །སེམས་ཅན་མཆོག་ལ་མགོ་བོས་ཕྱག་འཚལ་ལོ། །
en: “Unsurpassed Worthy One with supreme speech, Your realization is unequaled and inconceivable, And you master the truth, the Dharma, and the Vinaya; Supreme being, we prostrate to you!

source: འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་ཐ་བ་འཇིག །
en: “You have conquered the afflictions of desire, anger, and ignorance,

source: དགོན་པར་བཞུགས་དགྱེས་བསྙེངས་པ་མི་མངའ་བ། །རིན་ཆེན་མཛོད་དང་རིན་ཆེན་སྟོན་པ་པོ། །བཅོམ་ལྡན་རྒྱལ་པོའི་རྒྱལ་ལ་ཕྱག་འཚལ་ལོ། །
en: You enjoy staying in the wilderness, and you are free from fear; Revealer of precious treasures and jewels, Blessed One, king of kings, we prostrate to you!

source: སྤྱན་སྔར་དྲི་བྲལ་ཉོན་མོངས་མི་མངའ་བ། །ས་ཡི་དབང་པོ་ཕ་རོལ་དགྲ་འཇོམས་པ། །པད་མོ་ལྟ་བུར་སྲིད་གསུམ་མི་གོས་པ། །བདེ་གཤེགས་མཆོག་བརྙེས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “There are no stains and no afflictions in you. Ruler of the earth, subjugator of enemies, Like a lotus you are untainted by the three worlds; Blissful One with supreme realization, we prostrate to you!

source: འགྲོ་བའི་ནང་ན་མིག་དང་འདྲར་སྤྱོད་ཅིང་། །ཉི་ཟླ་འདི་ཡི་འོད་ནི་སྤ་བཀོང་བ། །འཁོར་ལོས་སྒྱུར་བའི་རིགས་སུ་རྒྱལ་པོར་སྐྱེས། །
en: “Among beings you are like their eyes, You outshine the light of the sun and the moon, And you manifest as the ruler in a family of universal monarchs;

source: འཁོར་ལོ་མཚན་མངའ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: You who possess the mark of the wheel, we prostrate to you!

source: མིང་དང་གཟུགས་ལ་ནམ་ཡང་མི་ཆགས་ཤིང་། །མགོན་དང་དཔུང་དང་སྐྱབས་དང་དཔུང་གཉེན་གྱུར། །
en: “You are never attached to name-and-form, And you are a protector, a support, a refuge, and a helping friend.

source: ཁྱོད་དང་མཚུངས་མེད་ལྷག་པ་ག་ལ་ཞིག །
en: You are peerless—who could surpass you?

source: མཐའ་ཡས་དབྱངས་ལ་མགོ་བོས་ཕྱག་འཚལ་ལོ། །
en: You with an endless voice, we prostrate to you!

source: བརྙེས་དང་མ་བརྙེས་ནམ་ཡང་ཆགས་མི་མངའ། །
en: “You are never attached to gain and loss,

source: འཇིག་རྟེན་ཆོས་རྣམས་ཟིལ་གྱིས་མནན་ཏེ་བཞུགས། །
en: You outshine all worldly concerns, And

source: ཆགས་སྲེད་འཁྲི་ཤིང་དྲ་བ་གྲོལ་མཛད་པ། །བཅོམ་ལྡན་འཇིག་རྟེན་མགོན་ལ་ཕྱག་འཚལ་ལོ། །
en: you liberate beings from the ties and webs of attachment and craving; Blessed One, protector of the world , we prostrate to you!

source: དུལ་བ་ཐུགས་ནི་རྟག་ཏུ་མཉམ་པར་གཞག །
en: “Your controlled mind is always composed,

source: ཉོན་མོངས་བསྲེགས་ཏེ་སྟོབས་བཅུས་རབ་བཞུགས་ཤིང་། །འགྲོ་ལ་ཟང་ཟིང་མི་མངའ་སྦྱིན་སྩོལ་པ། །སྦྱིན་པའི་གནས་ལ་མགོ་བོས་ཕྱག་འཚལ་ལོ། །
en: All your afflictions have been consumed, you abide in the ten powers, And you generously provide for beings who have no possessions; Worthy of our gifts, we prostrate to you!

source: སྨྲ་མཆོག་དམ་པ་མཚན་གྱི་འོད་འཕྲོས་པ། །ལམ་ལོག་ཕྱིན་ཅི་ལོག་ནི་རྣམ་པར་སྤངས། །
en: “Sublime and supreme teacher, you shine with the light of the marks, You have abandoned the mistaken paths, And

source: འཇམ་ཞིང་སྣུམ་ལ་སྙན་པའི་གསུང་གསུང་པ། །སྲིད་པ་གསུམ་ལས་འཕགས་ལ་ཕྱག་འཚལ་ལོ། །
en: you speak with a gentle, smooth, and delightful voice; You who have risen above the three worlds, we prostrate to you!

source: མི་མཆོག་གདུང་བས་གདུངས་པ་མི་མངའ་བ། །རྫུ་འཕྲུལ་གྱིས་ནི་བྱེ་བའི་ཞིང་དུ་གཤེགས། །
en: “Foremost among humans, you are free from the torments of suffering, You miraculously travel to millions of pure fields, And

source: འགྲོ་བ་རབ་ཏུ་སྒྲོལ་བའི་གྲུ་མཛད་པ། །བཅོམ་ལྡན་བྲན་འདྲ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: you steer the boat that leads beings to freedom; Blessed One, supporter of beings, we prostrate to you!

source: བཅོམ་ལྡན་བརྩོན་འགྲུས་དག་ལ་སྟོན་མཛད་པ། །ཆགས་ཤིང་ཞེན་པའི་འགྲོ་དང་མངོན་ཤེས་དྲུག །ལྡན་ཞིང་མཁས་པའི་ཉན་ཐོས་རྣམས་ཀྱང་འགྲེལ། །
en: “Blessed One, you instruct those who are diligent, And you illuminate those who are caught in attachment and clinging, Those who have developed the six higher perceptions, and the wise hearers;

source: འགྲོ་དྲུག་ཉེ་གཤེགས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: You who reach out to the six classes of beings, we prostrate to you!

source: གསེར་གྱི་ཁ་དོག་འདྲ་ལ་ཕྱག་འཚལ་ལོ། །
en: “You who have the color of gold, we prostrate to you!

source: ཞི་གནས་དབང་པོ་དུལ་ལ་ཕྱག་འཚལ་ལོ། །
en: You who are tranquil and whose senses are under control, we prostrate to you!

source: སྟོན་གྱི་ཟླ་འདྲའི་ཞལ་ལ་ཕྱག་འཚལ་ལོ། །
en: You with a face resembling the autumn moon, we prostrate to you!

source: མི་མཆོག་ཡོན་ཏན་མངའ་ལ་ཕྱག་འཚལ་ལོ། །
en: Foremost among humans with excellent qualities, we prostrate to you!

source: ཉོན་མོངས་བསྲེགས་ཤིང་བསྙེངས་པ་མི་མངའ་བ། །སྐྱེ་དགུ་འདི་དག་བསྒྲལ་དཀའ་ཆུ་བཞི་སྒྲོལ། །
en: “All your afflictions have been consumed, you know no fear, And you liberate all beings from the four rivers that are so difficult to escape.

source: བསྒོམས་ཤིང་དབང་པོ་ཐུལ་བའི་བཅོམ་ལྡན་འདས། །ཁྱོད་ལ་སྐྱབས་སུ་མཆི་བར་མཆིད་ཀྱིས་འཚལ། །
en: Blessed One, you are disciplined and your senses are under control; With this homage, we go for refuge in you!

source: ཐུབ་པས་སྦྱིན་པ་བསམ་གྱིས་མི་ཁྱབ་སྩལ། །
en: “Lord, you perform generosity on an inconceivable scale.

source: བསླངས་ན་དབང་པོ་དགྱེས་པར་རབ་འགྱུར་བ། །ཕ་རོལ་དག་ལ་སྦྱིན་པ་མཆོག་སྩོལ་བ། །གཏོང་དཔའ་བཅོམ་ལྡན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: When someone asks for charity, it fills you with delight. Blessed One, generous hero who extends The highest form of generosity toward others, we prostrate to you!

source: སེམས་ཅན་ང་རྒྱལ་རྒྱགས་ཁེངས་གཏི་མུག་པ། །རྒྱུ་དང་རྐྱེན་དང་བྱ་བ་འགལ་བགྱིད་རྣམས། །འཕགས་པ་བླ་ན་མེད་པའི་ལམ་མཆོག་ལ། །རྣམ་པར་འདྲེན་པ་ཆེན་པོ་ཁྱོད་ཀྱིས་བཀོད། །
en: “Proud, haughty, arrogant, and ignorant beings Who act in opposition to the principle of causes, conditions, and actions Are brought onto the unsurpassed noble path By you, Great Guide.

source: ཕུང་པོ་རང་བཞིན་གྱིས་ནི་སྟོང་མཁྱེན་ནས། །ལས་དང་ཉོན་མོངས་ཟིལ་གྱིས་མནན་ཏེ་བཞུགས། །
en: “You subjugate karma and afflictions By realizing the intrinsically empty nature of the aggregates.

source: འདྲེན་པ་འགྲོ་བ་རྣམས་ཀྱི་སོམ་ཉི་གཅོད། །
en: Great leader, you eliminate the doubts of beings;

source: བཅོམ་ལྡན་དུས་གསུང་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Blessed One who speaks in a timely way, we prostrate to you!

source: བདེན་པའི་ཆོས་ལ་དགྱེས་ཤིང་མཉམ་པར་བཞག །
en: “Delighted by the true Dharma, your mind is composed And

source: ཆོས་རྣམས་ཀུན་ལ་མངའ་དབང་ཕ་རོལ་ཕྱིན། །
en: you have mastered and perfected all qualities.

source: བླ་ན་མེད་པ་ཁ་ལོ་སྒྱུར་བ་མཆོག །བཅོམ་ལྡན་དེད་དཔོན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: You are an unsurpassed, supreme leader; Blessed One, great captain, we prostrate to you!

source: འཆོས་པ་མི་མངའ་གཡོ་སྒྱུ་རྣམས་དང་བྲལ། །བདུད་ཀྱི་སྡེ་རྣམས་འཇོམས་པའི་སྟོབས་པོ་ཆེ། །མི་མཆོག་ལམ་དང་ལམ་མ་ལགས་ལ་མཁས། །
en: “You are free from pretense and deceit And possess the great power that subjugates the hordes of Māra. Supreme human, you can tell the correct path from the incorrect, And,

source: རླུང་དམར་ལྟ་བུར་ཅི་ལའང་ཆགས་མི་མངའ། །
en: like a strong wind, you are not attached to anything.

source: !གཟིར་བར་གྱུར་གསལ་ཕ་རོལ་ཤིན་ཏུ་གནས། །
en: “You have cleared away all torment and reached perfection.

source: ཐུབ་པ་བས་མ་འཚལ་བའི་བང་མཛོད་མངའ། །
en: Sage, you possess an inexhaustible treasury.

source: སྤྱད་པ་སྤྱོད་པའི་ཚེ་ན་གང་གཱ་ཡི། །བྱེ་མ་སྙེད་ཀྱི་མི་མཆོག་རྣམས་ལ་མཆོད། །
en: While you practiced bodhisattva conduct, you worshiped As many supreme beings as there are grains of sand in the Ganges.

source: མཐུ་བརྙེས་མི་གཡོ་བསམ་གྱིས་མི་ཁྱབ་པ། །ཆགས་པའི་སྐྱོན་མི་མངའ་ཞིང་ཐང་ལ་བཞུགས། །
en: “Your power and attainment are unwavering and inconceivable, You are free from the defect of attachment, and you have reached dry land.

source: གནས་ན་བཞུགས་པའི་རྒྱལ་བ་རྣམས་ཀྱིས་བསྟེན། །
en: Where you dwell, you are attended by victors;

source: དེ་སླད་མི་རྣམས་མཆོག་ལ་ཕྱག་འཚལ་ལོ། །
en: That is why we prostrate to you, foremost among humans!

source: སྐྱེ་དང་ན་དང་རྒ་ཤི་རྣམ་པར་སྤངས། །
en: “You have conquered birth, old age, sickness, and death, And

source: ཚེ་རབས་བྱེ་བ་བསམ་མི་ཁྱབ་པ་དགོངས། །
en: you perceive countless millions of past lives.

source: བཅོམ་ལྡན་འདས་ཀྱི་མཁྱེན་པའི་གདུགས་འོད་ཀྱིས། །འཇིགས་པ་ཆེན་པོའི་དྲ་བ་རབ་ཏུ་འདྲལ། །
en: Blessed One, the light shining from the parasol of your wisdom Tears the web of great fear asunder.

source: འདྲེན་པ་རྨི་འདྲར་ཆོས་རྣམས་ཐུགས་སུ་ཆུད། །
en: “Great leader, you understand that phenomena are like dreams,

source: ཕྱག་དང་ཞབས་ལ་བཀྲ་ཤིས་མཚན་མངའ་ཞིང་། །བཀྲ་ཤིས་བགྱིད་ལས་འཇམ་པའི་རན་སློང་བ། །བཅོམ་ལྡན་བཀྲ་ཤིས་མཛད་ལ་ཕྱག་འཚལ་ལོ། །
en: Your hands and feet are adorned with auspicious marks, And fresh grass grows due to your auspiciousness; Blessed One with auspicious deeds, we prostrate to you!

source: གཟུངས་རྣམས་ལ་ནི་དབང་གི་ཕ་རོལ་ཕྱིན། །
en: “Lord, you have perfected the power of the dhāraṇīs, And

source: ཟང་ཟིང་མི་མངའ་ཆོས་ཀྱི་སྦྱིན་པ་སྩོལ། །
en: you provide the gift of Dharma without concern for material things.

source: ཐུབ་པ་ཆོས་ཀྱི་རྔ་ནི་རབ་བརྡུངས་པ། །ཆོས་རྗེ་བཅོམ་ལྡན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Sage, you beat the drum of Dharma; Dharma Lord, Blessed One, we prostrate to you!

source: ཤཱཀྱའི་རིགས་དུས་རྒྱལ་པོའི་ལས་བྱུང་བ། །དབང་པོ་ཞི་ཞིང་ཐུགས་ཀྱང་རབ་ཏུ་ཞི། །སྟོན་པ་སྲིད་གསུམ་འཇིག་རྟེན་རྣམ་གཟིགས་པ། །བདེ་གཤེགས་ཞི་ཐུགས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Great teacher, you were born to the king of the Śākya clan, You are calm and tranquil, And you watch over the three worlds; Blissful One with a peaceful mind, we prostrate to you!

source: བདུད་རྣམས་དཔུང་དང་བཅས་པས་རྣོ་བ་ཡི། །རལ་གྲི་ཐོགས་ནས་བྱང་ཆུབ་དྲུང་ལྷགས་ཀྱང་། །ཁྱོད་ཀྱི་བ་སྤུ་ཙམ་ཡང་མ་གཡོས་ཏེ། །
en: “Although Māra and his armies came to the tree of awakening Brandishing sharp swords, Not a single hair of your body moved;
